# How to create an empty dataframe in python

In [1]:
## using a simple list

In [5]:
import pandas as pd

lst=['Name','age','Marks','salary','city']
df=pd.DataFrame(lst)
df

        0
0    Name
1     age
2   Marks
3  salary
4    city

In [6]:
data=[['Name','age','Marks','salary','city'],['Pallavi','25',95,'90k','indore']]
df=pd.DataFrame(data)
df

         0    1      2       3       4
0     Name  age  Marks  salary    city
1  Pallavi   25     95     90k  indore

In [7]:
df=pd.DataFrame(data,index=["a","b"],columns=['info1','info2','info3','info4','info5'])
df

     info1 info2  info3   info4   info5
a     Name   age  Marks  salary    city
b  Pallavi    25     95     90k  indore

In [21]:
## using Zip function

lst1=['Raj','Rajat','karan','Suresh']
lst2=[56,78,89,88]
lst3=['m','s','t']
list(zip(lst1,lst2,lst3))

[('Raj', 56, 'm'), ('Rajat', 78, 's'), ('karan', 89, 't')]

In [24]:
df=pd.DataFrame(list(zip(lst1,lst2,lst3)),columns=['Name','Marks','subject'])
df

    Name  Marks subject
0    Raj     56       m
1  Rajat     78       s
2  karan     89       t

In [16]:
## using multidimentional list

lst2=[['Name','Pallavi'],
   ['Age',31],
   ['salary',90],
   ['subject','Maths']]
df=pd.DataFrame(lst2,columns=['information','Input'])

In [17]:
df

  information    Input
0        Name  Pallavi
1         Age       31
2      salary       90
3     subject    Maths

In [18]:
## Using Dictionary of List

In [19]:
dictionary={'First_name':['Raj','Rajat','Karan'],
           'Last_name':['Gautam','Sharma','Tripathi'],
           'Age':[29,38,36],
           'Marks':[99,78,75],
           'subject':['Maths','Science','Social Science']}
pd.DataFrame(dictionary)

  First_name Last_name  Age  Marks         subject
0        Raj    Gautam   29     99           Maths
1      Rajat    Sharma   38     78         Science
2      Karan  Tripathi   36     75  Social Science